-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: i12a602.p.ssafy.io    Database: newBlendeo
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `chat_messages`
--

DROP TABLE IF EXISTS `chat_messages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chat_messages` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `chat_room_id` bigint NOT NULL,
  `user_id` int NOT NULL,
  `content` text NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `chat_room_id` (`chat_room_id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `chat_messages_ibfk_1` FOREIGN KEY (`chat_room_id`) REFERENCES `chat_rooms` (`id`) ON DELETE CASCADE,
  CONSTRAINT `chat_messages_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=82 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chat_messages`
--

LOCK TABLES `chat_messages` WRITE;
/*!40000 ALTER TABLE `chat_messages` DISABLE KEYS */;
INSERT INTO `chat_messages` VALUES (1,1,2,'안녕하세요! 영상보고 연락드렸어요!!!','2025-02-19 06:33:28'),(2,1,2,'드럼 연주 인상깊게 봤습니다~','2025-02-19 06:33:49'),(3,1,1,'ㅎㅎ 감사합니다 ㅎㅎ','2025-02-19 06:37:37'),(4,1,1,'채준님 영상도 올라오면 찾아보겠습니다!','2025-02-19 06:37:37'),(5,3,2,'안녕하세요 파파보이님!!','2025-02-19 06:45:06'),(6,4,5,'헤이 유','2025-02-19 06:45:14'),(7,4,5,'지금 모해','2025-02-19 06:45:15'),(8,4,5,'잠깐 ㅂ','2025-02-19 06:45:17'),(9,4,5,'밖으로 나올래','2025-02-19 06:45:20'),(10,3,2,'진짜 파파보이이신가요..??','2025-02-19 06:45:23'),(11,4,5,'네가 보고싶다고','2025-02-19 06:45:25'),(12,4,5,'거울 속에 나~','2025-02-19 06:45:33'),(13,4,5,'쏘 풜펙트','2025-02-19 06:45:35'),(14,4,5,'새로 산 신 발','2025-02-19 06:45:40'),(15,4,5,'오 예~~~~','2025-02-19 06:45:42'),(16,1,1,'와우 안녕하십니까 ㅎㅎ','2025-02-19 16:05:27'),(17,5,5,'ㅋ','2025-02-20 03:18:49'),(18,5,5,'뭔가','2025-02-20 03:18:54'),(19,5,6,'파파보이 ','2025-02-20 03:18:55'),(20,5,5,'느껴버린것같아','2025-02-20 03:18:57'),(21,5,6,'이거 ','2025-02-20 03:19:07'),(22,5,6,'근데 색깔잉','2025-02-20 03:19:09'),(23,5,6,'왜이래용','2025-02-20 03:19:11'),(24,5,6,'ㅎㅎㅎ','2025-02-20 03:19:11'),(25,5,5,'ㅋㅋㅋㅋㅋㅋㅋ','2025-02-20 03:19:13'),(26,5,6,'왜 우리','2025-02-20 03:19:14'),(27,5,6,'파랑이랑 보라가 ','2025-02-20 03:19:16'),(28,5,6,'섞여있어요?','2025-02-20 03:19:18'),(29,5,6,'우리 색깔','2025-02-20 03:19:20'),(30,5,5,'그르네에','2025-02-20 03:19:21'),(31,5,6,'보란데 왜 다들','2025-02-20 03:19:22'),(32,5,6,'파랑써요?','2025-02-20 03:19:24'),(33,5,6,'왜그러는거야?','2025-02-20 03:19:26'),(34,5,5,'바보랏거','2025-02-20 03:19:27'),(35,5,5,'ㅠ','2025-02-20 03:19:30'),(36,5,6,'민서님 왜그러셨어요','2025-02-20 03:19:30'),(37,5,6,'보라색은','2025-02-20 03:19:34'),(38,5,6,'똥인가요?','2025-02-20 03:19:36'),(39,5,6,'보라보라ㅗ발봐롸보라보로라돌이','2025-02-20 03:19:41'),(40,5,5,'보리보리쌀','2025-02-20 03:19:42'),(41,5,6,'쌀','2025-02-20 03:19:43'),(42,5,6,'보리보리보리','2025-02-20 03:19:45'),(43,5,5,'보리','2025-02-20 03:19:45'),(44,5,6,'쌀 보리쌀','2025-02-20 03:19:47'),(45,3,5,'ㅎㅇ','2025-02-20 08:42:56'),(46,5,6,'하이욤','2025-02-20 13:59:28'),(47,5,5,'ㅎㅇㅎㅇ','2025-02-20 13:59:30'),(48,7,1,'https://blendeo.shop/project/50','2025-02-20 14:21:47'),(49,3,5,'ㅎㅇㅎㅇ?','2025-02-20 14:30:58'),(50,8,1,'안녕하세요!','2025-02-20 14:56:41'),(51,8,1,'영상 넘 잘 봤어요!','2025-02-20 14:56:46'),(52,8,1,'기회가 된다면 나중에 같이 합주해보고 싶어요','2025-02-20 14:56:54'),(53,8,16,'인상 깊게 봐주셔서 감사해요 ㅎㅎ','2025-02-20 14:56:57'),(54,8,1,'ㅎㅎ','2025-02-20 14:57:36'),(55,8,1,'영상통화하실래요?','2025-02-20 15:09:16'),(56,8,16,'네! 쥬아욯ㅎ','2025-02-20 15:09:36'),(57,9,16,'여러분~~','2025-02-20 18:54:43'),(58,9,7,'저희,,,,, 이번 주 주말에 보는 거지요~~~?','2025-02-20 18:54:44'),(59,9,16,'안녕하세요~~','2025-02-20 18:54:45'),(60,9,6,'안녕하세요 ㅎㅎ','2025-02-20 18:54:57'),(61,9,6,'저는 가능합니다!','2025-02-20 18:54:59'),(62,9,4,'안녕하세여~!','2025-02-20 18:55:00'),(63,9,2,'저 5분 늦을것같아요..ㅜㅜ','2025-02-20 18:55:20'),(64,9,2,'ㅜ','2025-02-20 18:55:20'),(65,9,2,'빨리 갈게요!','2025-02-20 18:55:24'),(66,9,7,'괜춚 ^^ 추우니까~~ 조심히 오세요~~~^^','2025-02-20 18:55:58'),(67,9,7,'그보다~~ 만나기 전에 마지막 점검 어떻습니까~~?','2025-02-20 18:57:08'),(68,10,7,'야','2025-02-20 18:57:25'),(69,10,7,'야야','2025-02-20 18:57:27'),(70,10,7,'야야야','2025-02-20 18:57:28'),(71,9,7,'영상으로 들어오셔요~~','2025-02-20 18:57:44'),(72,10,20,'zㅣ존이시네요','2025-02-20 18:58:03'),(73,10,7,'그럼요~','2025-02-20 18:59:02'),(74,10,7,'야야','2025-02-20 18:59:09'),(75,10,7,'위에','2025-02-20 18:59:21'),(76,10,7,'영통도된다','2025-02-20 18:59:30'),(77,10,20,'아 그건 됐어요','2025-02-20 18:59:46'),(78,10,20,'잘거에요','2025-02-20 18:59:48'),(79,10,7,'ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2025-02-20 19:00:00'),(80,10,7,'주무세여 ^^','2025-02-20 19:00:02'),(81,9,16,'저 들어갑니당!!!','2025-02-20 19:00:15');
/*!40000 ALTER TABLE `chat_messages` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-02-21  9:55:44
